-- ****************************************************************** --

INSERT INTO
    permissions
VALUES
    (1, 'Auth', 'User', 'View'), (2, 'Listing', 'Property', 'View'),
    (3, 'Listing', 'Property', 'Create'), (4, 'Listing', 'Property', 'Update'),
    (5, 'Listing', 'Property', 'Delete');

-- ****************************************************************** --

INSERT INTO
    roles
VALUES
    (1, 'Administrator', 'admin'), (2, 'Anonymous', 'anonymous'),
    (3, 'Agent', 'agent'), (4, 'User', 'user');

-- ****************************************************************** --

INSERT INTO
    roles_permissions
VALUES
    (1, 1), (1, 2), (1, 3), (1, 4), (1, 5),
    (2, 2), (3, 2), (3, 3), (3, 4), (3, 5),
    (4, 2);

-- ****************************************************************** --

INSERT INTO
    property_types
VALUES
    ('Διαμέρισμα'), ('Μονοκατοικία'), ('Γεωτεμάχιο'),
    ('Οικόπεδο'), ('Επαγγελματικός Χώρος');

-- ****************************************************************** --

INSERT INTO
    floors
VALUES
    (1, -2, 'Ημιυπόγειο'),
    (2, -1, 'Ισόγειο'),
    (3, 0, 'Ημιόροφος'),
    (4, 1, '1ος Όροφος'),
    (5, 2, '2ος Όροφος'),
    (6, 3, '3ος Όροφος'),
    (7, 4, '4ος Όροφος'),
    (8, 5, '5ος Όροφος');